In [1]:
import pandas as pd

In [2]:
#앞 수업의 예를 다시 가져오자.

students = [{'Name': 'Alice','Class': 'Physics','Score': 85},
            {'Name': 'Jack', 'Class': 'Chemistry','Score': 82},
            {'Name': 'Helen','Class': 'Biology','Score': 90}]

df = pd.DataFrame(students, index=['school1', 'school2', 'school3'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

## 먼저 열(column) 단위의 인덱싱과 슬라이싱

In [3]:
# 1. 하나만 추출 (인덱싱)

df['Class']

# 데이터프레이임이 아닌 시리즈가 반환됨을 알 수 있다.

school1      Physics
school2    Chemistry
school3      Biology
Name: Class, dtype: object

In [4]:
# 데이터프레임으로 한 열만 추출하려면?

df[['Class']]

#[]로 한번 더 감싸 준다. 여기서 우리는 []로 감싸진 횟수가 그 구조의 차원을 나타낸다는 점을 직감하게 된다.
# [] -> 1차원 (시리즈), [[]] -> 2차원, [[[]]] ->3차원 (판다스에서는 많이 쓰이지 않으나, 넘파이 등에선 자주 나타남)

             Class
school1    Physics
school2  Chemistry
school3    Biology

In [5]:
# 2개 이상 연속 추출 (슬라이싱)

df['Name':'Class']

Empty DataFrame
Columns: [Name, Class, Score]
Index: []

In [ ]:
# 위에서 보듯 열 단위 슬라이싱은 값이 반환되지 않는다.
# 즉, 열 단위로 슬라이싱은 불가능!??
# 불가능하지는 않다. 그 원리는 아래에서 .loc과 같이 설명한다

In [9]:
df.loc[:,'Name':'Class']

          Name      Class
school1  Alice    Physics
school2   Jack  Chemistry
school3  Helen    Biology

In [10]:
# 그렇다면 여러 열을 추출하는 다른 방법은?

df[['Name', 'Score']]

#이렇게 하나씩 열의 이름을 적어 주는 수밖에 없다.
# 주의할 점 : 반드시 대괄호 두 개!!

          Name  Score
school1  Alice     85
school2   Jack     82
school3  Helen     90

In [11]:
# 심지어 순서도 지정해 추출할 수 있다.

df[['Score','Name']]

         Score   Name
school1     85  Alice
school2     82   Jack
school3     90  Helen

## 행(row) 단위의 인덱싱과 슬라이싱
### 여기에는 열 단위 추출과 달리 두가지 방법이 있다
* .loc[]에 의한 방법
* .iloc[]에 의한 방법

.loc이나 .iloc이나 둘 다 함수도, 메소드도 아닌 애트리뷰트(attribute)이다.

그래서 뒤에 ()가 아닌, []가 달림.

In [12]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [13]:
# 1.한 행씩 색인하는 법 : 인덱싱

# .loc[]은 인덱스의 인덱스 명 자체를 기준으로 색인한다.
# locate : 찾다라는 말의 약어

df.loc['school1']

Name       Alice
Class    Physics
Score         85
Name: school1, dtype: object

In [14]:
#반면 .iloc은 (눈에는 안 보일지 모르는) 인덱스의 순서를 기준으로 색인한다.
# index locate의 약어

df.iloc[2]

Name       Helen
Class    Biology
Score         90
Name: school3, dtype: object

In [15]:
#2. 연속된 여러 행을 색인하는 법 : 슬라이싱
# 열 단위 색인이 단독으로는 안 되는 경우와는 달리, 행 단위 슬라이싱은 가능하다

# .loc[]을 이용

df.loc['school1':'school2']

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82

In [16]:
# .iloc[]을 이용

df.iloc[0:2]

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82

In [17]:
# 양자의 또 다른 차이점은 .loc[]은 끝 점을 포함하고, 
# .iloc[]은 "일반 파이썬의 슬라이싱이 그렇듯" 끝 점을 포함하지 않는다는 점이다

In [18]:
#여기서 예제를 살짝 바꾸어 본다
# 인덱스를 1부터 3까지의 정수로 지정하였다

df.index = range(10,13)

df

     Name      Class  Score
10  Alice    Physics     85
11   Jack  Chemistry     82
12  Helen    Biology     90

In [19]:
# .loc으로 추출해 보자

df.loc[10:11]  #여기서 1, 2 인덱스 이름이다

     Name      Class  Score
10  Alice    Physics     85
11   Jack  Chemistry     82

In [20]:
df.iloc[0:2]

     Name      Class  Score
10  Alice    Physics     85
11   Jack  Chemistry     82

In [21]:
# 3. 여러 개의 열을 각각 추출
df

     Name      Class  Score
10  Alice    Physics     85
11   Jack  Chemistry     82
12  Helen    Biology     90

In [22]:
# 1번째와 세번째 열을 순서를 바꾸어 추출해 보자
# .loc[]에 의한 방법

df.loc[[12,10]]
# [[]] 임을 잊지 않는다

     Name    Class  Score
12  Helen  Biology     90
10  Alice  Physics     85

In [23]:
# .iloc[]에 의한 방법

df.iloc[[2,0]]

     Name    Class  Score
12  Helen  Biology     90
10  Alice  Physics     85

## 열, 행 단위 인덱싱과 슬라이싱의 결합

In [24]:
# 원래의 데이터프레임을 다시 가져온다

students = [{'Name': 'Alice','Class': 'Physics','Score': 85},
            {'Name': 'Jack', 'Class': 'Chemistry','Score': 82},
            {'Name': 'Helen','Class': 'Biology','Score': 90}]

df = pd.DataFrame(students, index=['school1', 'school2', 'school3'])
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [26]:
# 열,행 단위 인덱싱과 슬라이싱은 두가지 동작의 결합일 뿐, 내부적으로 동시에 일어나지는 않는다.
# 따라서 자신의 취향에 맞게 먼저 행을 색인하고, 열을 색인하는 것도 가능하고
# 열을 먼저 색인하고 행을 색인하는 것도 당연히 가능하다.

In [27]:
# 열 먼저 색인 후 행을 색인

df[['Name','Score']].loc[['school3','school1']]

          Name  Score
school3  Helen     90
school1  Alice     85

In [33]:
#행 먼저 색인 후, 열을 색인

df.loc[['school3','school1']][['Name','Score']]

          Name  Score
school3  Helen     90
school1  Alice     85

In [34]:
df.loc['school1', 'Name']

'Alice'

In [29]:
# 다만 행을 먼저 색인하는 경우에는 다음과 같이 간략히 줄여 표현하는 것이 가능하다.

df.loc[['school3','school1'],['Name','Score']]

# df.loc[행, 열]

          Name  Score
school3  Helen     90
school1  Alice     85

In [30]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school3  Helen    Biology     90

In [31]:
# 여러개가 아닌 하나씩의 열과 행만을 인덱싱 해보자

df.iloc[0]['Name']

'Alice'

In [32]:
df.iloc[0:2, 0:2]

          Name      Class
school1  Alice    Physics
school2   Jack  Chemistry

In [33]:
df.loc['school1':'school2', 'Name':'Class']

          Name      Class
school1  Alice    Physics
school2   Jack  Chemistry

## 공공데이터를 통한 연습

In [34]:
# 지난 차시에 저장해 두었던 csv파일을 둘러온다

weather = pd.read_csv('./weather_tmp.csv', encoding = 'utf-8')
weather.head()

,지점,일시,평균기온,최저기온,최저기온시각,최고기온,최고기온시각,1시간최다강수량,일강수량,평균풍속,평균기압,합계일조시간,평균지면온도
0,108,2021-01-01,-4.2,-9.8,511,1.6,1447,NaN,NaN,2.0,1014.9,6.5,-3.4
1,108,2021-01-02,-5.0,-8.4,805,-1.4,1346,NaN,NaN,2.6,1018.5,9.0,-3.9
2,108,2021-01-03,-5.6,-9.1,536,-2.0,1238,NaN,NaN,2.0,1023.0,5.5,-4.9
3,108,2021-01-04,-3.5,-8.4,656,0.3,1535,NaN,0.0,1.7,1020.3,4.6,-3.3
4,108,2021-01-05,-5.5,-9.9,2356,-2.1,1,NaN,0.0,2.9,1019.2,8.6,-3.2

In [35]:
# loc을 통해 1~3 행, 지점과 일시 행을 추출해 보자

weather.loc[0:2,['평균기온', '최고기온']]

   평균기온  최고기온
0  -4.2   1.6
1  -5.0  -1.4
2  -5.6  -2.0

In [36]:
# 가령 우리가 2021년의 10번째, 20번째, 30번째 날(인덱스로는 9, 19, 29가 될것이다)의
# 최고기온, 평균기온, 최저기온 (순서대로)을 불러 오려면 어떻게 하여야 할까?

In [37]:
# 가능한 하나의 방법

weather.iloc[[9,19,29]][['최고기온','평균기온','최저기온']]

    최고기온  평균기온  최저기온
9   -2.7  -7.7 -12.8
19   7.1  -0.1  -6.6
29   5.2  -1.6  -8.1

In [38]:
#또 다른 방법은 최고기온은 6번째 열, 평균기온은 3번째, 최저기온은 4번째이므로,,,

weather.iloc[[9,19,29],[5,2,3]]  #파이썬은 0부터 시작하므로...

    최고기온  평균기온  최저기온
9   -2.7  -7.7 -12.8
19   7.1  -0.1  -6.6
29   5.2  -1.6  -8.1

In [39]:
# 매우 중요하므로, 익숙해질 때까지 practice, practice, practice!!

In [40]:
weather.loc[9:29:10]

,지점,일시,평균기온,최저기온,최저기온시각,최고기온,최고기온시각,1시간최다강수량,일강수량,평균풍속,평균기압,합계일조시간,평균지면온도
9,108,2021-01-10,-7.7,-12.8,538,-2.7,1406,NaN,NaN,1.3,1017.0,6.2,-6.1
19,108,2021-01-20,-0.1,-6.6,513,7.1,1559,NaN,NaN,2.2,1019.1,8.9,-2.0
29,108,2021-01-30,-1.6,-8.1,1,5.2,1614,NaN,0.5,2.5,1015.0,6.4,-0.3